#pragma once
#include"STRMAG.h"

//+++++++++++++++++クラスの役割++++++++++++++++++++++++
//
//化学式から原子名と組成比を読み取る。
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++

class FORM_RATE
{
public:

	//========================================
	//  情報を表示
	//========================================
	void disp_info();

	//========================================
	//  入力された化学式から原子名、組成比を得る
	//========================================
	void FORMin(char* Chemical_formula);

	//========================================
	//  メンバ変数を得る
	//========================================
	char* GetName(int num) { return atomname[num].getstr(); };
	int GetRate(int num) { return rate[num]; };
	int GetAtomNum() { return atom_num; };


	//***************コントラスタ、デストラクタ*****************
	FORM_RATE();
	~FORM_RATE();
	//**********************************************************

private:
	int atom_num; //原子数
	char* formula; //-------------------
	char* formula2;//  処理の途中で出てくるもの
	char* formula3;//-------------------
	STRMAG* atomname; //原子名が格納されている

	int* rate; //組成比の配列

	//========================================
	//  クラスの初期化に必要な処理を行う
	//========================================
	void rw_formula();
	void oa_formula();
	void RateIn();
	void AtomIn();
};

