#pragma once
#include<iostream>

using namespace std;
//+++++++++++++++++クラスの役割++++++++++++++++++++++++
//
//文字列を管理する
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++
class STRMAG
{
public:
	//========================================
	//  文字列を読み込む
	//-------------引数について---------------
	//  str...読み込む文字列
	//========================================
	void strin(char* str);

	//========================================
	//  文字列を表示
	//========================================
	void strout(){
		cout << STR << '\n';
		return;
	}

	//========================================
	//  文字列を取得
	//========================================
	char* getstr() { return STR; }

	//メモリの開放等
	STRMAG();
	~STRMAG() { delete[] STR; return; }
private:
	char* STR; //文字列
};

